---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.StructuralMaterialType
source: html/ea0c3f86-529c-71c1-e86e-dc1abc7efa95.htm
---
# Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.StructuralMaterialType Property

The structural material type.

## Syntax (C#)
```csharp
public StructuralMaterialType StructuralMaterialType { get; }
```